export const HOMEWORK_TITLE = 'HW Lesson 4 - Components. Practice'

export const TASKS = [
  {
    id: 'messenger',
    title: 'Месенджер',
    shortTitle: 'Чат',
    description:
      'Створити імітатор месенджера. Є можливість додавати/відображати повідомлення і ставити лайки (додайте стилі на свій розсуд).',
    requirements: [
      'Можливість додавати повідомлення',
      'Відображення повідомлень у списку',
      'Система лайків для повідомлень',
      'Стилізація на власний розсуд',
    ],
  },
  {
    id: 'guess-number',
    title: 'Вгадай число',
    shortTitle: 'Гра',
    description: 'Гра "Вгадай число".',
    requirements: [
      "Комп'ютер генерує трицифрове число",
      'Кожен гравець по черзі задає цифру, якої ще не було (відсліковуємо, щоб цифри не повторювалися гравцями — не дозволяємо повторно ввести (блокуємо кнопку "Зробити хід"))',
      'Якщо цифру вгадано, вона відображаться у полі гри "Число"',
      'Програє той, хто вгадав останню цифру',
      'Бажано відображати біля області кожного гравця цифри, які він вгадав',
    ],
  },
]
